CSI API ETABS v1

# cDesignCompositeBeam Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDesignCompositeBeam

    Public Interface cDesignCompositeBeam

    Dim instance As cDesignCompositeBeam

    public interface class cDesignCompositeBeam

    type cDesignCompositeBeam =  interface end

The cDesignCompositeBeam type exposes the following members.

Methods

| Name| Description
---|---|---
|
DeleteResults|
|
GetCode|  Retrieves the composite
beam design code.
|
GetComboDeflection|
|
GetComboStrength|
|
GetDesignSection|
|
GetGroup|
|
GetResultsAvailable|  This
function determines if the composite beam design results are available.
|
GetSummaryResults|
|
GetTargetDispl|
|
GetTargetPeriod|
|
ResetOverwrites|
|
SetAutoSelectNull|
|
SetCode|  Sets the composite beam
design code.
|
SetComboDeflection|
|
SetComboStrength|
|
SetDesignSection|
|
SetGroup|
|
SetTargetDispl|
|
SetTargetPeriod|
|
StartDesign|  Starts the composite
beam design.
|
VerifyPassed|
|
VerifySections|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com